---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderMinWidthTooLargeForParallelTreadsFailure
source: html/9c6ae605-9ca9-c24a-b988-6d976fd3bcad.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderMinWidthTooLargeForParallelTreadsFailure Property

The value for Minimum Width on Inside Boundary is too large to satisfy the number of Parallel Treads at the Start or End as specified in the Run Instance properties.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderMinWidthTooLargeForParallelTreadsFailure { get; }
```